// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1


// Console.Write("Введите трехначеное число");
// int num = Math.Abs(Convert.ToInt32(Console.ReadLine()));
// if (num < 100 || num > 999) Console.WriteLine("Введенное Вами число не является трехзначным!");
// else
// {
//     num = ((num % 100) - (num % 10)) / 10;
//     Console.WriteLine($"Вотрая цифра введенного Вами числа: {num}");
// }

